app/controllers/resources_datas_controller.rb

SELECT * FROM "resources_datas"
---
  def index
    @resources_datas = ResourcesData.all