app/controllers/resources_fields_controller.rb

  def index
    @resources_table = ResourcesTable.find(params[:resources_table_id])
---
SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 2)

  def show
    @resources_table = ResourcesTable.find(params[:resources_table_id])
    @resources_field = @resources_table.resources_fields.find(params[:id])
---
SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 2)
SELECT * FROM "resources_fields" WHERE ("resources_fields"."id" = 7 AND ("resources_fields".resources_table_id = 2))

  def new
    @resources_table = ResourcesTable.find(params[:resources_table_id])
---
SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 4)

  def edit
    @resources_table = ResourcesTable.find(params[:resources_table_id])
    @resources_field = @resources_table.resources_fields.find(params[:id])
---
SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 2)
SELECT * FROM "resources_fields" WHERE ("resources_fields"."id" = 7 AND ("resources_fields".resources_table_id = 2))

  def create
    @resources_table = ResourcesTable.find(params[:resources_table_id])
    @resources_field = @resources_table.resources_fields.build(params[:resources_field])

    respond_to do |format|
      if @resources_field.save
---
SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 4)
INSERT INTO "resources_fields" ("name", "created_at", "updated_at", "resources_table_id") VALUES('Name', '2010-07-20 05:16:31', '2010-07-20 05:16:31', 4)

  def update
    @resources_table = ResourcesTable.find(params[:resources_table_id])
    @resources_field = ResourcesField.find(params[:id])

    respond_to do |format|
      if @resources_field.update_attributes(params[:resources_field])
---
SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 2)
SELECT * FROM "resources_fields" WHERE ("resources_fields"."id" = 7)
UPDATE "resources_fields" SET "updated_at" = '2010-07-21 01:20:41', "name" = 'Email' WHERE "id" = 7

  def destroy
    @resources_table = ResourcesTable.find(params[:resources_table_id])
    @resources_field = ResourcesField.find(params[:id])
    @resources_field.destroy
---
SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 4)
SELECT * FROM "resources_fields" WHERE ("resources_fields"."id" = 4)
DELETE FROM "resources_fields" WHERE "id" = 4