app/controllers/resources_tables_controller.rb

SELECT * FROM "resources_tables"
---
  def index
    @resources_tables = ResourcesTable.all

SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 2)
---
  def show
    @resources_table = ResourcesTable.find(params[:id])

SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 2)
---
  def edit
    @resources_table = ResourcesTable.find(params[:id])

INSERT INTO "resources_tables" ("name", "created_at", "updated_at") VALUES('Contacs', '2010-07-20 05:13:25', '2010-07-20 05:13:25')
---
  def create
    @resources_table = ResourcesTable.new(params[:resources_table])

    respond_to do |format|
      if @resources_table.save

SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 2)
UPDATE "resources_tables" SET "updated_at" = '2010-07-21 01:32:48', "name" = 'Contacts' WHERE "id" = 2
---
  def update
    @resources_table = ResourcesTable.find(params[:id])

    respond_to do |format|
      if @resources_table.update_attributes(params[:resources_table])

SELECT * FROM "resources_tables" WHERE ("resources_tables"."id" = 4)
DELETE FROM "resources_tables" WHERE "id" = 4
---
  def destroy
    @resources_table = ResourcesTable.find(params[:id])
    @resources_table.destroy